/* Задание 1.
 * Модифицировать программный код, полученный в результате
 * выполнения практического задания 2 по теме
 * «Структура программы на языке С/С++».
 * Написать программы на языке С++ с использование пользовательских
 * функций согласно варианту задания.
 * В задании 3 для передачи параметров в функцию использовать указатель
 * (первый параметр) и ссылку (второй параметр).
*/

// Дан натуральный отрезок чисел [A,B]. Найти те числа этого отрезка,
// которые делятся на данное число K.
// Проверку, делится ли данное число на K,
// сделать с помощью логической функции пользователя.

#include <iostream>

inline bool mod(int number, int k)
{
	return (number % k == 0) ? true : false;
}

int main()
{
	int a, b, k;
	std::cout << "Enter 'a': ";
	std::cin >> a;
	std::cout << "Enter 'b': ";
	std::cin >> b;
	std::cout << "Enter 'k': ";
	std::cin >> k;

	if (a > b)
	{
		std::cout << "Error: 'a' > 'b'.\n";
		return -1;
	}

	for (int i = a; i <= b; ++i)
		if ( mod(i, k) )
			std::cout << i << ' ';
	
	std::cout << std::endl;

	return 0;
}
