/* Задание 3.
 * Написать на языке С++ программы для решения следующих задач.
 * В задаче 1 использовать оператор цикла с постусловием (do while),
 * в задаче 2 – оператор цикла с предусловием (while),
 * в задаче 3 – оператор цикла с известным числом повторений (for).
*/

// Дан целочисленный отрезок [a; b].
// Вывести из этого отрезка все отрицательные числа.

#include <iostream>

int main()
{
	int a, b;
	std::cout << "Enter 'a': ";
	std::cin >> a;
	std::cout << "Enter 'b': ";
	std::cin >> b;

	if (a > b)
	{
		std::cout << "Error: a > b.\n";
		return -1;
	}

	for (int i = a; i < 0 && i <= b; ++i)
		std::cout << i << ' ';

	std::cout << std::endl;

	return 0;
}
